src/Catalogs/Конфигурации/Конфигурации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Конфигурации</name>
  <predefined>
    <items>
      <name>Финансы1С</name>
      <description>Финансы 1 С</description>
    </items>
  </predefined>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеРазработки</name>
    <type>
      <types>CatalogRef.Хранилища</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеОбновления</name>
    <type>
      <types>CatalogRef.Хранилища</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяКонвейерОбработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьБазыТестирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогическаяПодсистемаПоУмолчанию</name>
    <type>
      <types>CatalogRef.ЛогическиеПодсистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроектGitEDT</name>
    <type>
      <types>CatalogRef.ПроектыGIT</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеВремяЗахватаПоУмолчаниюЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсключаемыеАвторы</name>
    <attributes>
      <name>ИмяПользователя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШагиКонвейера</name>
    <attributes>
      <name>ДействиеКонвейераОбработки</name>
      <type>
        <types>CatalogRef.ДействияКонвейераОбработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТестовыеБазы</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаСоединенияИсточник</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаСоединенияПриемник</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПометкаУдаления</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбъектыЗапускаИнтеграционныхТестов</name>
    <attributes>
      <name>ИмяОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Конфигурации/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Спр.Ссылка КАК ДействиеКонвейераОбработки,
		|	НЕ ПроектыШагиКонвейера.Ссылка ЕСТЬ NULL КАК Отметка,
		|	Спр.ПорядокСортировки КАК ПорядокСортировки
		|ИЗ
		|	Справочник.ДействияКонвейераОбработки КАК Спр
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Конфигурации.ШагиКонвейера КАК ПроектыШагиКонвейера
		|		ПО Спр.Ссылка = ПроектыШагиКонвейера.ДействиеКонвейераОбработки
		|			И (ПроектыШагиКонвейера.Ссылка = &Проект)
		|ГДЕ
		|	Спр.ПометкаУдаления = ЛОЖЬ
		|	И Спр.Родитель = ЗНАЧЕНИЕ(Справочник.ДействияКонвейераОбработки.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПорядокСортировки";
	Запрос.УстановитьПараметр("Проект", Объект.Ссылка);
	ШагиКонвейера.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюШагиКонвейераНаСервере()
	
	Объект.ШагиКонвейера.Очистить();
	Для Каждого Стр Из ШагиКонвейера.НайтиСтроки(Новый Структура("Отметка", Истина)) Цикл
		Объект.ШагиКонвейера.Добавить().ДействиеКонвейераОбработки = Стр.ДействиеКонвейераОбработки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПередЗаписьюШагиКонвейераНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗагрузитьСписокОбъектовЗавершение(Текст, ДополнительныеПараметры) Экспорт
	
	Если Текст = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Сч=1 по СтрЧислоСтрок(Текст) Цикл
		Строка = СтрПолучитьСтроку(Текст, Сч);
		Объект.ОбъектыЗапускаИнтеграционныхТестов.Добавить().ИмяОбъекта = Строка;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗапуститьКонвейерОбработки(Команда)
	БП = ЗапуститьКонвейерОбработкиНаСервере();
	ПоказатьЗначение(Новый ОписаниеОповещения, БП);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСписокОбъектов(Команда)
	
	Текст = "";
	Продолжение = Новый ОписаниеОповещения("ЗагрузитьСписокОбъектовЗавершение", ЭтотОбъект);
	ПоказатьВводСтроки(Продолжение, Текст, "Объекты для загрузки", 0, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьМетаданные(Команда)
	ЗагрузитьМетаданныеНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗапуститьКонвейерОбработкиНаСервере()
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("РучнойЗапуск", Истина);
	Реквизиты.Вставить("ШагиКонвейера", ШагиКонвейера.Выгрузить(ШагиКонвейера.НайтиСтроки(Новый Структура("Отметка", Истина))));
	БП = БизнесПроцессы.КонвейерОбработки.ЗапускНовогоБизнесПроцесса(Объект.Ссылка, Реквизиты);
	Возврат БП;
КонецФункции

&НаСервере
Процедура ЗагрузитьМетаданныеНаСервере()
	ЗагрузкаМетаданных.ЗагрузитьМетаданные(Объект.Ссылка);
КонецПроцедуры

#КонецОбласти
